{"type": "bundle", "id": "bundle--f933aa7d-16cc-4b7b-9438-3a09a210b158", "objects": [{"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--b77cf5f3-6060-475d-bd60-40ccbf28fdc2", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2018-01-16T16:13:52.465Z", "modified": "2021-04-29T14:49:39.188Z", "name": "Forced Authentication", "description": "Adversaries may gather credential material by invoking or forcing a user to automatically provide authentication information through a mechanism in which they can intercept.\n\nThe Server Message Block (SMB) protocol is commonly used in Windows networks for authentication and communication between systems for access to resources and file sharing. When a Windows system attempts to connect to an SMB resource it will automatically attempt to authenticate and send credential information for the current user to the remote system. (Citation: Wikipedia Server Message Block) This behavior is typical in enterprise environments so that users do not need to enter credentials to access network resources.\n\nWeb Distributed Authoring and Versioning (WebDAV) is also typically used by Windows systems as a backup protocol when SMB is blocked or fails. WebDAV is an extension of HTTP and will typically operate over TCP ports 80 and 443. (Citation: Didier Stevens WebDAV Traffic) (Citation: Microsoft Managing WebDAV Security)\n\nAdversaries may take advantage of this behavior to gain access to user account hashes through forced SMB/WebDAV authentication. An adversary can send an attachment to a user through spearphishing that contains a resource link to an external server controlled by the adversary (i.e. [Template Injection](https://attack.mitre.org/techniques/T1221)), or place a specially crafted file on navigation path for privileged accounts (e.g. .SCF file placed on desktop) or on a publicly accessible share to be accessed by victim(s). When the user's system accesses the untrusted resource it will attempt authentication and send information, including the user's hashed credentials, over SMB to the adversary controlled server. (Citation: GitHub Hashjacking) With access to the credential hash, an adversary can perform off-line [Brute Force](https://attack.mitre.org/techniques/T1110) cracking to gain access to plaintext credentials. (Citation: Cylance Redirect to SMB)\n\nThere are several different ways this can occur. (Citation: Osanda Stealing NetNTLM Hashes) Some specifics from in-the-wild use include:\n\n* A spearphishing attachment containing a document with a resource that is automatically loaded when the document is opened (i.e. [Template Injection](https://attack.mitre.org/techniques/T1221)). The document can include, for example, a request similar to <code>file[:]//[remote address]/Normal.dotm</code> to trigger the SMB request. (Citation: US-CERT APT Energy Oct 2017)\n* A modified .LNK or .SCF file with the icon filename pointing to an external reference such as <code>\\\\[remote address]\\pic.png</code> that will force the system to load the resource when the icon is rendered to repeatedly gather credentials. (Citation: US-CERT APT Energy Oct 2017)", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "credential-access"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1187", "external_id": "T1187"}, {"source_name": "Wikipedia Server Message Block", "description": "Wikipedia. (2017, December 16). Server Message Block. Retrieved December 21, 2017.", "url": "https://en.wikipedia.org/wiki/Server_Message_Block"}, {"source_name": "Didier Stevens WebDAV Traffic", "description": "Stevens, D. (2017, November 13). WebDAV Traffic To Malicious Sites. Retrieved December 21, 2017.", "url": "https://blog.didierstevens.com/2017/11/13/webdav-traffic-to-malicious-sites/"}, {"source_name": "Microsoft Managing WebDAV Security", "description": "Microsoft. (n.d.). Managing WebDAV Security (IIS 6.0). Retrieved December 21, 2017.", "url": "https://www.microsoft.com/technet/prodtechnol/WindowsServer2003/Library/IIS/4beddb35-0cba-424c-8b9b-a5832ad8e208.mspx"}, {"source_name": "GitHub Hashjacking", "description": "Dunning, J. (2016, August 1). Hashjacking. Retrieved December 21, 2017.", "url": "https://github.com/hob0/hashjacking"}, {"source_name": "Cylance Redirect to SMB", "description": "Cylance. (2015, April 13). Redirect to SMB. Retrieved December 21, 2017.", "url": "https://www.cylance.com/content/dam/cylance/pdfs/white_papers/RedirectToSMB.pdf"}, {"source_name": "Osanda Stealing NetNTLM Hashes", "description": "Osanda Malith Jayathissa. (2017, March 24). Places of Interest in Stealing NetNTLM Hashes. Retrieved January 26, 2018.", "url": "https://osandamalith.com/2017/03/24/places-of-interest-in-stealing-netntlm-hashes/"}, {"source_name": "US-CERT APT Energy Oct 2017", "description": "US-CERT. (2017, October 20). Alert (TA17-293A): Advanced Persistent Threat Activity Targeting Energy and Other Critical Infrastructure Sectors. Retrieved November 2, 2017.", "url": "https://www.us-cert.gov/ncas/alerts/TA17-293A"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_contributors": ["Teodor Cimpoesu", "Sudhanshu Chauhan, @Sudhanshu_C"], "x_mitre_data_sources": ["Network Traffic: Network Traffic Content", "Network Traffic: Network Traffic Flow", "File: File Access", "File: File Creation", "File: File Modification"], "x_mitre_detection": "Monitor for SMB traffic on TCP ports 139, 445 and UDP port 137 and WebDAV traffic attempting to exit the network to unknown external systems. If attempts are detected, then investigate endpoint data sources to find the root cause. For internal traffic, monitor the workstation-to-workstation unusual (vs. baseline) SMB traffic. For many networks there should not be any, but it depends on how systems on the network are configured and where resources are located.\n\nMonitor creation and modification of .LNK, .SCF, or any other files on systems and within virtual environments that contain resources that point to external network resources as these could be used to gather credentials when the files are rendered. (Citation: US-CERT APT Energy Oct 2017)", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": false, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_permissions_required": ["User"], "x_mitre_platforms": ["Windows"], "x_mitre_version": "1.2"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--232b7f21-adf9-4b42-b936-b9d6f7df856e", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2020-03-11T14:49:36.954Z", "modified": "2022-10-25T14:00:00.188Z", "name": "Malicious File", "description": "An adversary may rely upon a user opening a malicious file in order to gain execution. Users may be subjected to social engineering to get them to open a file that will lead to code execution. This user action will typically be observed as follow-on behavior from [Spearphishing Attachment](https://attack.mitre.org/techniques/T1566/001). Adversaries may use several types of files that require a user to execute them, including .doc, .pdf, .xls, .rtf, .scr, .exe, .lnk, .pif, and .cpl.\n\nAdversaries may employ various forms of [Masquerading](https://attack.mitre.org/techniques/T1036) and [Obfuscated Files or Information](https://attack.mitre.org/techniques/T1027) to increase the likelihood that a user will open and successfully execute a malicious file. These methods may include using a familiar naming convention and/or password protecting the file and supplying instructions to a user on how to open it.(Citation: Password Protected Word Docs) \n\nWhile [Malicious File](https://attack.mitre.org/techniques/T1204/002) frequently occurs shortly after Initial Access it may occur at other phases of an intrusion, such as when an adversary places a file in a shared directory or on a user's desktop hoping that a user will click on it. This activity may also be seen shortly after [Internal Spearphishing](https://attack.mitre.org/techniques/T1534).", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "execution"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1204/002", "external_id": "T1204.002"}, {"source_name": "Password Protected Word Docs", "description": "Lawrence Abrams. (2017, July 12). PSA: Don't Open SPAM Containing Password Protected Word Docs. Retrieved January 5, 2022.", "url": "https://www.bleepingcomputer.com/news/security/psa-dont-open-spam-containing-password-protected-word-docs/"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_contributors": ["TruKno"], "x_mitre_data_sources": ["Process: Process Creation", "File: File Creation"], "x_mitre_deprecated": false, "x_mitre_detection": "Monitor the execution of and command-line arguments for applications that may be used by an adversary to gain initial access that require user interaction. This includes compression applications, such as those for zip files, that can be used to [Deobfuscate/Decode Files or Information](https://attack.mitre.org/techniques/T1140) in payloads.\n\nAnti-virus can potentially detect malicious documents and files that are downloaded and executed on the user's computer. Endpoint sensing or network sensing can potentially detect malicious events once the file is opened (such as a Microsoft Word document or PDF reaching out to the internet or spawning powershell.exe).", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": true, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_platforms": ["Linux", "macOS", "Windows"], "x_mitre_remote_support": false, "x_mitre_version": "1.2"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--2e34237d-8574-43f6-aace-ae2915de8597", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2020-03-02T19:05:18.137Z", "modified": "2022-04-25T14:00:00.188Z", "name": "Spearphishing Attachment", "description": "Adversaries may send spearphishing emails with a malicious attachment in an attempt to gain access to victim systems. Spearphishing attachment is a specific variant of spearphishing. Spearphishing attachment is different from other forms of spearphishing in that it employs the use of malware attached to an email. All forms of spearphishing are electronically delivered social engineering targeted at a specific individual, company, or industry. In this scenario, adversaries attach a file to the spearphishing email and usually rely upon [User Execution](https://attack.mitre.org/techniques/T1204) to gain execution. Spearphishing may also involve social engineering techniques, such as posing as a trusted source.\n\nThere are many options for the attachment such as Microsoft Office documents, executables, PDFs, or archived files. Upon opening the attachment (and potentially clicking past protections), the adversary's payload exploits a vulnerability or directly executes on the user's system. The text of the spearphishing email usually tries to give a plausible reason why the file should be opened, and may explain how to bypass system protections in order to do so. The email may also contain instructions on how to decrypt an attachment, such as a zip file password, in order to evade email boundary defenses. Adversaries frequently manipulate file extensions and icons in order to make attached executables appear to be document files, or files exploiting one application appear to be a file for a different one. ", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "initial-access"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1566/001", "external_id": "T1566.001"}, {"source_name": "capec", "url": "https://capec.mitre.org/data/definitions/163.html", "external_id": "CAPEC-163"}, {"source_name": "Microsoft Anti Spoofing", "description": "Microsoft. (2020, October 13). Anti-spoofing protection in EOP. Retrieved October 19, 2020.", "url": "https://docs.microsoft.com/en-us/microsoft-365/security/office-365-security/anti-spoofing-protection?view=o365-worldwide"}, {"source_name": "ACSC Email Spoofing", "description": "Australian Cyber Security Centre. (2012, December). Mitigating Spoofed Emails Using Sender Policy Framework. Retrieved October 19, 2020.", "url": "https://www.cyber.gov.au/sites/default/files/2019-03/spoof_email_sender_policy_framework.pdf"}, {"source_name": "Elastic - Koadiac Detection with EQL", "description": "Stepanic, D.. (2020, January 13). Embracing offensive tooling: Building detections against Koadic using EQL. Retrieved November 30, 2020.", "url": "https://www.elastic.co/blog/embracing-offensive-tooling-building-detections-against-koadic-using-eql"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_contributors": ["Philip Winther"], "x_mitre_data_sources": ["Application Log: Application Log Content", "File: File Creation", "Network Traffic: Network Traffic Content", "Network Traffic: Network Traffic Flow"], "x_mitre_detection": "Network intrusion detection systems and email gateways can be used to detect spearphishing with malicious attachments in transit. Detonation chambers may also be used to identify malicious attachments. Solutions can be signature and behavior based, but adversaries may construct attachments in a way to avoid these systems.\n\nFiltering based on DKIM+SPF or header analysis can help detect when the email sender is spoofed.(Citation: Microsoft Anti Spoofing)(Citation: ACSC Email Spoofing)\n\nAnti-virus can potentially detect malicious documents and attachments as they're scanned to be stored on the email server or on the user's computer. Endpoint sensing or network sensing can potentially detect malicious events once the attachment is opened (such as a Microsoft Word document or PDF reaching out to the internet or spawning Powershell.exe) for techniques such as [Exploitation for Client Execution](https://attack.mitre.org/techniques/T1203) or usage of malicious scripts.\n\nMonitor for suspicious descendant process spawning from Microsoft Office and other productivity software.(Citation: Elastic - Koadiac Detection with EQL)", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": true, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_platforms": ["macOS", "Windows", "Linux"], "x_mitre_version": "2.2"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--cbb66055-0325-4111-aca0-40547b6ad5b0", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2020-03-13T20:26:49.433Z", "modified": "2022-05-11T14:00:00.188Z", "name": "Hidden Window", "description": "Adversaries may use hidden windows to conceal malicious activity from the plain sight of users. In some cases, windows that would typically be displayed when an application carries out an operation can be hidden. This may be utilized by system administrators to avoid disrupting user work environments when carrying out administrative tasks. \n\nOn Windows, there are a variety of features in scripting languages in Windows, such as [PowerShell](https://attack.mitre.org/techniques/T1059/001), Jscript, and [Visual Basic](https://attack.mitre.org/techniques/T1059/005) to make windows hidden. One example of this is <code>powershell.exe -WindowStyle Hidden</code>. (Citation: PowerShell About 2019)\n\nSimilarly, on macOS the configurations for how applications run are listed in property list (plist) files. One of the tags in these files can be <code>apple.awt.UIElement</code>, which allows for Java applications to prevent the application's icon from appearing in the Dock. A common use for this is when applications run in the system tray, but don't also want to show up in the Dock.\n\nAdversaries may abuse these functionalities to hide otherwise visible windows from users so as not to alert the user to adversary activity on the system.(Citation: Antiquated Mac Malware)", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "defense-evasion"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1564/003", "external_id": "T1564.003"}, {"source_name": "PowerShell About 2019", "description": "Wheeler, S. et al.. (2019, May 1). About PowerShell.exe. Retrieved October 11, 2019.", "url": "https://docs.microsoft.com/en-us/powershell/module/Microsoft.PowerShell.Core/About/about_PowerShell_exe?view=powershell-5.1"}, {"source_name": "Antiquated Mac Malware", "description": "Thomas Reed. (2017, January 18). New Mac backdoor using antiquated code. Retrieved July 5, 2017.", "url": "https://blog.malwarebytes.com/threat-analysis/2017/01/new-mac-backdoor-using-antiquated-code/"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_contributors": ["Travis Smith, Tripwire"], "x_mitre_data_sources": ["Process: Process Creation", "Script: Script Execution", "File: File Modification", "Command: Command Execution"], "x_mitre_detection": "Monitor processes and command-line arguments for actions indicative of hidden windows. In Windows, enable and configure event logging and PowerShell logging to check for the hidden window style. In MacOS, plist files are ASCII text files with a specific format, so they're relatively easy to parse. File monitoring can check for the <code>apple.awt.UIElement</code> or any other suspicious plist tag in plist files and flag them.", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": true, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_permissions_required": ["User"], "x_mitre_platforms": ["macOS", "Windows", "Linux"], "x_mitre_version": "1.1"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--dc31fe1e-d722-49da-8f5f-92c7b5aff534", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2018-10-17T00:14:20.652Z", "modified": "2022-05-11T14:00:00.188Z", "name": "Template Injection", "description": "Adversaries may create or modify references in user document templates to conceal malicious code or force authentication attempts. For example, Microsoft’s Office Open XML (OOXML) specification defines an XML-based format for Office documents (.docx, xlsx, .pptx) to replace older binary formats (.doc, .xls, .ppt). OOXML files are packed together ZIP archives compromised of various XML files, referred to as parts, containing properties that collectively define how a document is rendered.(Citation: Microsoft Open XML July 2017)\n\nProperties within parts may reference shared public resources accessed via online URLs. For example, template properties may reference a file, serving as a pre-formatted document blueprint, that is fetched when the document is loaded.\n\nAdversaries may abuse these templates to initially conceal malicious code to be executed via user documents. Template references injected into a document may enable malicious payloads to be fetched and executed when the document is loaded.(Citation: SANS Brian Wiltse Template Injection) These documents can be delivered via other techniques such as [Phishing](https://attack.mitre.org/techniques/T1566) and/or [Taint Shared Content](https://attack.mitre.org/techniques/T1080) and may evade static detections since no typical indicators (VBA macro, script, etc.) are present until after the malicious payload is fetched.(Citation: Redxorblue Remote Template Injection) Examples have been seen in the wild where template injection was used to load malicious code containing an exploit.(Citation: MalwareBytes Template Injection OCT 2017)\n\nAdversaries may also modify the <code>*\\template</code> control word within an .rtf file to similarly conceal then download malicious code. This legitimate control word value is intended to be a file destination of a template file resource that is retrieved and loaded when an .rtf file is opened. However, adversaries may alter the bytes of an existing .rtf file to insert a template control word field to include a URL resource of a malicious payload.(Citation: Proofpoint RTF Injection)(Citation: Ciberseguridad Decoding malicious RTF files)\n\nThis technique may also enable [Forced Authentication](https://attack.mitre.org/techniques/T1187) by injecting a SMB/HTTPS (or other credential prompting) URL and triggering an authentication attempt.(Citation: Anomali Template Injection MAR 2018)(Citation: Talos Template Injection July 2017)(Citation: ryhanson phishery SEPT 2016)", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "defense-evasion"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1221", "external_id": "T1221"}, {"source_name": "Microsoft Open XML July 2017", "description": "Microsoft. (2014, July 9). Introducing the Office (2007) Open XML File Formats. Retrieved July 20, 2018.", "url": "https://docs.microsoft.com/previous-versions/office/developer/office-2007/aa338205(v=office.12)"}, {"source_name": "SANS Brian Wiltse Template Injection", "description": "Wiltse, B.. (2018, November 7). Template Injection Attacks - Bypassing Security Controls by Living off the Land. Retrieved April 10, 2019.", "url": "https://www.sans.org/reading-room/whitepapers/testing/template-injection-attacks-bypassing-security-controls-living-land-38780"}, {"source_name": "Redxorblue Remote Template Injection", "description": "Hawkins, J. (2018, July 18). Executing Macros From a DOCX With Remote Template Injection. Retrieved October 12, 2018.", "url": "http://blog.redxorblue.com/2018/07/executing-macros-from-docx-with-remote.html"}, {"source_name": "MalwareBytes Template Injection OCT 2017", "description": "Segura, J. (2017, October 13). Decoy Microsoft Word document delivers malware through a RAT. Retrieved July 21, 2018.", "url": "https://blog.malwarebytes.com/threat-analysis/2017/10/decoy-microsoft-word-document-delivers-malware-through-rat/"}, {"source_name": "Proofpoint RTF Injection", "description": "Raggi, M. (2021, December 1). Injection is the New Black: Novel RTF Template Inject Technique Poised for Widespread Adoption Beyond APT Actors . Retrieved December 9, 2021.", "url": "https://www.proofpoint.com/us/blog/threat-insight/injection-new-black-novel-rtf-template-inject-technique-poised-widespread"}, {"source_name": "Ciberseguridad Decoding malicious RTF files", "description": "Pedrero, R.. (2021, July). Decoding malicious RTF files. Retrieved November 16, 2021.", "url": "https://ciberseguridad.blog/decodificando-ficheros-rtf-maliciosos/"}, {"source_name": "Anomali Template Injection MAR 2018", "description": "Intel_Acquisition_Team. (2018, March 1). Credential Harvesting and Malicious File Delivery using Microsoft Office Template Injection. Retrieved July 20, 2018.", "url": "https://forum.anomali.com/t/credential-harvesting-and-malicious-file-delivery-using-microsoft-office-template-injection/2104"}, {"source_name": "Talos Template Injection July 2017", "description": "Baird, S. et al.. (2017, July 7). Attack on Critical Infrastructure Leverages Template Injection. Retrieved July 21, 2018.", "url": "https://blog.talosintelligence.com/2017/07/template-injection.html"}, {"source_name": "ryhanson phishery SEPT 2016", "description": "Hanson, R. (2016, September 24). phishery. Retrieved July 21, 2018.", "url": "https://github.com/ryhanson/phishery"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_contributors": ["Michael Raggi @aRtAGGI", "Brian Wiltse @evalstrings", "Patrick Campbell, @pjcampbe11"], "x_mitre_data_sources": ["Process: Process Creation", "Network Traffic: Network Traffic Content", "Network Traffic: Network Connection Creation"], "x_mitre_defense_bypassed": ["Static File Analysis"], "x_mitre_detection": "Analyze process behavior to determine if user document applications (such as Office) are performing actions, such as opening network connections, reading files, spawning abnormal child processes (ex: [PowerShell](https://attack.mitre.org/techniques/T1059/001)), or other suspicious actions that could relate to post-compromise behavior.\n\nMonitor .rtf files for strings indicating the <code>&#42;\\template</code> control word has been modified to retrieve a URL resource, such as <code>&#42;\\template http</code> or <code>&#42;\\template \\u-</code>.", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": false, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_permissions_required": ["User"], "x_mitre_platforms": ["Windows"], "x_mitre_version": "1.3"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--970a3432-3237-47ad-bcca-7d8cbb217736", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2020-03-09T13:48:55.078Z", "modified": "2022-05-11T14:00:00.188Z", "name": "PowerShell", "description": "Adversaries may abuse PowerShell commands and scripts for execution. PowerShell is a powerful interactive command-line interface and scripting environment included in the Windows operating system.(Citation: TechNet PowerShell) Adversaries can use PowerShell to perform a number of actions, including discovery of information and execution of code. Examples include the <code>Start-Process</code> cmdlet which can be used to run an executable and the <code>Invoke-Command</code> cmdlet which runs a command locally or on a remote computer (though administrator permissions are required to use PowerShell to connect to remote systems).\n\nPowerShell may also be used to download and run executables from the Internet, which can be executed from disk or in memory without touching disk.\n\nA number of PowerShell-based offensive testing tools are available, including [Empire](https://attack.mitre.org/software/S0363),  [PowerSploit](https://attack.mitre.org/software/S0194), [PoshC2](https://attack.mitre.org/software/S0378), and PSAttack.(Citation: Github PSAttack)\n\nPowerShell commands/scripts can also be executed without directly invoking the <code>powershell.exe</code> binary through interfaces to PowerShell's underlying <code>System.Management.Automation</code> assembly DLL exposed through the .NET framework and Windows Common Language Interface (CLI).(Citation: Sixdub PowerPick Jan 2016)(Citation: SilentBreak Offensive PS Dec 2015)(Citation: Microsoft PSfromCsharp APR 2014)", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "execution"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1059/001", "external_id": "T1059.001"}, {"source_name": "Microsoft PSfromCsharp APR 2014", "description": "Babinec, K. (2014, April 28). Executing PowerShell scripts from C#. Retrieved April 22, 2019.", "url": "https://blogs.msdn.microsoft.com/kebab/2014/04/28/executing-powershell-scripts-from-c/"}, {"source_name": "SilentBreak Offensive PS Dec 2015", "description": "Christensen, L.. (2015, December 28). The Evolution of Offensive PowerShell Invocation. Retrieved December 8, 2018.", "url": "https://silentbreaksecurity.com/powershell-jobs-without-powershell-exe/"}, {"source_name": "FireEye PowerShell Logging 2016", "description": "Dunwoody, M. (2016, February 11). GREATER VISIBILITY THROUGH POWERSHELL LOGGING. Retrieved February 16, 2016.", "url": "https://www.fireeye.com/blog/threat-research/2016/02/greater_visibilityt.html"}, {"source_name": "Github PSAttack", "description": "Haight, J. (2016, April 21). PS>Attack. Retrieved June 1, 2016.", "url": "https://github.com/jaredhaight/PSAttack"}, {"source_name": "inv_ps_attacks", "description": "Hastings, M. (2014, July 16). Investigating PowerShell Attacks. Retrieved December 1, 2021.", "url": "https://powershellmagazine.com/2014/07/16/investigating-powershell-attacks/"}, {"source_name": "Malware Archaeology PowerShell Cheat Sheet", "description": "Malware Archaeology. (2016, June). WINDOWS POWERSHELL LOGGING CHEAT SHEET - Win 7/Win 2008 or later. Retrieved June 24, 2016.", "url": "http://www.malwarearchaeology.com/s/Windows-PowerShell-Logging-Cheat-Sheet-ver-June-2016-v2.pdf"}, {"source_name": "TechNet PowerShell", "description": "Microsoft. (n.d.). Windows PowerShell Scripting. Retrieved April 28, 2016.", "url": "https://technet.microsoft.com/en-us/scriptcenter/dd742419.aspx"}, {"source_name": "Sixdub PowerPick Jan 2016", "description": "Warner, J.. (2015, January 6). Inexorable PowerShell – A Red Teamer’s Tale of Overcoming Simple AppLocker Policies. Retrieved December 8, 2018.", "url": "http://www.sixdub.net/?p=367"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_contributors": ["Mayuresh Dani, Qualys", "Praetorian"], "x_mitre_data_sources": ["Script: Script Execution", "Command: Command Execution", "Process: Process Metadata", "Process: Process Creation", "Module: Module Load"], "x_mitre_deprecated": false, "x_mitre_detection": "If proper execution policy is set, adversaries will likely be able to define their own execution policy if they obtain administrator or system access, either through the Registry or at the command line. This change in policy on a system may be a way to detect malicious use of PowerShell. If PowerShell is not used in an environment, then simply looking for PowerShell execution may detect malicious activity.\n\nMonitor for loading and/or execution of artifacts associated with PowerShell specific assemblies, such as System.Management.Automation.dll (especially to unusual process names/locations).(Citation: Sixdub PowerPick Jan 2016)(Citation: SilentBreak Offensive PS Dec 2015)\n\nIt is also beneficial to turn on PowerShell logging to gain increased fidelity in what occurs during execution (which is applied to .NET invocations). (Citation: Malware Archaeology PowerShell Cheat Sheet) PowerShell 5.0 introduced enhanced logging capabilities, and some of those features have since been added to PowerShell 4.0. Earlier versions of PowerShell do not have many logging features.(Citation: FireEye PowerShell Logging 2016) An organization can gather PowerShell execution details in a data analytic platform to supplement it with other data.\n\nConsider monitoring for Windows event ID (EID) 400, which shows the version of PowerShell executing in the <code>EngineVersion</code> field (which may also be relevant to detecting a potential [Downgrade Attack](https://attack.mitre.org/techniques/T1562/010)) as well as if PowerShell is running locally or remotely in the <code>HostName</code> field. Furthermore, EID 400 may indicate the start time and EID 403 indicates the end time of a PowerShell session.(Citation: inv_ps_attacks)", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": true, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_platforms": ["Windows"], "x_mitre_remote_support": true, "x_mitre_version": "1.2"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--a2fdce72-04b2-409a-ac10-cc1695f4fce0", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2020-10-01T02:08:33.977Z", "modified": "2021-10-17T16:17:55.499Z", "name": "Tool", "description": "Adversaries may buy, steal, or download software tools that can be used during targeting. Tools can be open or closed source, free or commercial. A tool can be used for malicious purposes by an adversary, but (unlike malware) were not intended to be used for those purposes (ex: [PsExec](https://attack.mitre.org/software/S0029)). Tool acquisition can involve the procurement of commercial software licenses, including for red teaming tools such as [Cobalt Strike](https://attack.mitre.org/software/S0154). Commercial software may be obtained through purchase, stealing licenses (or licensed copies of the software), or cracking trial versions.(Citation: Recorded Future Beacon 2019)\n\nAdversaries may obtain tools to support their operations, including to support execution of post-compromise behaviors. In addition to freely downloading or purchasing software, adversaries may steal software and/or software licenses from third-party entities (including other adversaries).", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1588/002", "external_id": "T1588.002"}, {"source_name": "Recorded Future Beacon 2019", "description": "Recorded Future. (2019, June 20). Out of the Blue: How Recorded Future Identified Rogue Cobalt Strike Servers. Retrieved October 16, 2020.", "url": "https://www.recordedfuture.com/identifying-cobalt-strike-servers/"}, {"source_name": "Analyzing CS Dec 2020", "description": "Maynier, E. (2020, December 20). Analyzing Cobalt Strike for Fun and Profit. Retrieved October 12, 2021.", "url": "https://www.randhome.io/blog/2020/12/20/analyzing-cobalt-strike-for-fun-and-profit/"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_contributors": ["SOCCRATES", "Mnemonic AS"], "x_mitre_data_sources": ["Malware Repository: Malware Metadata"], "x_mitre_detection": "In some cases, malware repositories can also be used to identify features of tool use associated with an adversary, such as watermarks in [Cobalt Strike](https://attack.mitre.org/software/S0154) payloads.(Citation: Analyzing CS Dec 2020)\n\nMuch of this activity will take place outside the visibility of the target organization, making detection of this behavior difficult. Detection efforts may be focused on post-compromise phases of the adversary lifecycle.", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": true, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_platforms": ["PRE"], "x_mitre_version": "1.1"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2017-05-31T21:31:16.408Z", "modified": "2022-10-25T14:00:00.188Z", "name": "Ingress Tool Transfer", "description": "Adversaries may transfer tools or other files from an external system into a compromised environment. Tools or files may be copied from an external adversary-controlled system to the victim network through the command and control channel or through alternate protocols such as [ftp](https://attack.mitre.org/software/S0095). Once present, adversaries may also transfer/spread tools between victim devices within a compromised environment (i.e. [Lateral Tool Transfer](https://attack.mitre.org/techniques/T1570)). \n\nFiles can also be transferred using various [Web Service](https://attack.mitre.org/techniques/T1102)s as well as native or otherwise present tools on the victim system.(Citation: PTSecurity Cobalt Dec 2016)\n\nOn Windows, adversaries may use various utilities to download tools, such as `copy`, `finger`, and [PowerShell](https://attack.mitre.org/techniques/T1059/001) commands such as <code>IEX(New-Object Net.WebClient).downloadString()</code> and <code>Invoke-WebRequest</code>. On Linux and macOS systems, a variety of utilities also exist, such as `curl`, `scp`, `sftp`, `tftp`, `rsync`, `finger`, and `wget`.(Citation: t1105_lolbas)", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "command-and-control"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1105", "external_id": "T1105"}, {"source_name": "University of Birmingham C2", "description": "Gardiner, J.,  Cova, M., Nagaraja, S. (2014, February). Command & Control Understanding, Denying and Detecting. Retrieved April 20, 2016.", "url": "https://arxiv.org/ftp/arxiv/papers/1408/1408.1136.pdf"}, {"source_name": "t1105_lolbas", "description": "LOLBAS. (n.d.). LOLBAS Mapped to T1105. Retrieved March 11, 2022.", "url": "https://lolbas-project.github.io/#t1105"}, {"source_name": "PTSecurity Cobalt Dec 2016", "description": "Positive Technologies. (2016, December 16). Cobalt Snatch. Retrieved October 9, 2018.", "url": "https://www.ptsecurity.com/upload/corporate/ww-en/analytics/Cobalt-Snatch-eng.pdf"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_contributors": ["John Page (aka hyp3rlinx), ApparitionSec"], "x_mitre_data_sources": ["Network Traffic: Network Connection Creation", "Network Traffic: Network Traffic Flow", "File: File Creation", "Network Traffic: Network Traffic Content"], "x_mitre_deprecated": false, "x_mitre_detection": "Monitor for file creation and files transferred into the network. Unusual processes with external network connections creating files on-system may be suspicious. Use of utilities, such as [ftp](https://attack.mitre.org/software/S0095), that does not normally occur may also be suspicious.\n\nAnalyze network data for uncommon data flows (e.g., a client sending significantly more data than it receives from a server). Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious. Specifically, for the finger utility on Windows and Linux systems, monitor command line or terminal execution for the finger command. Monitor network activity for TCP port 79, which is used by the finger utility, and Windows <code>netsh interface portproxy</code> modifications to well-known ports such as 80 and 443. Furthermore, monitor file system for the download/creation and execution of suspicious files, which may indicate adversary-downloaded payloads. Analyze packet contents to detect communications that do not follow the expected protocol behavior for the port that is being used.(Citation: University of Birmingham C2)", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": false, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_platforms": ["Linux", "macOS", "Windows"], "x_mitre_version": "2.1"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--d1fcf083-a721-4223-aedf-bf8960798d62", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2020-03-09T14:12:31.196Z", "modified": "2022-04-25T14:00:00.188Z", "name": "Windows Command Shell", "description": "Adversaries may abuse the Windows command shell for execution. The Windows command shell ([cmd](https://attack.mitre.org/software/S0106)) is the primary command prompt on Windows systems. The Windows command prompt can be used to control almost any aspect of a system, with various permission levels required for different subsets of commands. The command prompt can be invoked remotely via [Remote Services](https://attack.mitre.org/techniques/T1021) such as [SSH](https://attack.mitre.org/techniques/T1021/004).(Citation: SSH in Windows)\n\nBatch files (ex: .bat or .cmd) also provide the shell with a list of sequential commands to run, as well as normal scripting operations such as conditionals and loops. Common uses of batch files include long or repetitive tasks, or the need to run the same set of commands on multiple systems.\n\nAdversaries may leverage [cmd](https://attack.mitre.org/software/S0106) to execute various commands and payloads. Common uses include [cmd](https://attack.mitre.org/software/S0106) to execute a single command, or abusing [cmd](https://attack.mitre.org/software/S0106) interactively with input and output forwarded over a command and control channel.", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "execution"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1059/003", "external_id": "T1059.003"}, {"source_name": "SSH in Windows", "description": "Microsoft. (2020, May 19). Tutorial: SSH in Windows Terminal. Retrieved July 26, 2021.", "url": "https://docs.microsoft.com/en-us/windows/terminal/tutorials/ssh"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_data_sources": ["Process: Process Creation", "Command: Command Execution"], "x_mitre_detection": "Usage of the Windows command shell may be common on administrator, developer, or power user systems depending on job function. If scripting is restricted for normal users, then any attempt to enable scripts running on a system would be considered suspicious. If scripts are not commonly used on a system, but enabled, scripts running out of cycle from patching or other administrator functions are suspicious. Scripts should be captured from the file system when possible to determine their actions and intent.\n\nScripts are likely to perform actions with various effects on a system that may generate events, depending on the types of monitoring used. Monitor processes and command-line arguments for script execution and subsequent behavior. Actions may be related to network and system information Discovery, Collection, or other scriptable post-compromise behaviors and could be used as indicators of detection leading back to the source script.", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": true, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_permissions_required": ["User"], "x_mitre_platforms": ["Windows"], "x_mitre_remote_support": true, "x_mitre_version": "1.2"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--b3d682b6-98f2-4fb0-aa3b-b4df007ca70a", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2017-05-31T21:30:32.662Z", "modified": "2022-11-08T14:00:00.188Z", "name": "Obfuscated Files or Information", "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \n\nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and [Deobfuscate/Decode Files or Information](https://attack.mitre.org/techniques/T1140) for [User Execution](https://attack.mitre.org/techniques/T1204). The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary. (Citation: Volexity PowerDuke November 2016) Adversaries may also use compressed or archived scripts, such as JavaScript. \n\nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery. (Citation: Linux/Cdorked.A We Live Security Analysis) Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. (Citation: Carbon Black Obfuscation Sept 2016)\n\nAdversaries may also obfuscate commands executed from payloads or directly via a [Command and Scripting Interpreter](https://attack.mitre.org/techniques/T1059). Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms. (Citation: FireEye Obfuscation June 2017) (Citation: FireEye Revoke-Obfuscation July 2017)(Citation: PaloAlto EncodedCommand March 2017) ", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "defense-evasion"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1027", "external_id": "T1027"}, {"source_name": "Volexity PowerDuke November 2016", "description": "Adair, S.. (2016, November 9). PowerDuke: Widespread Post-Election Spear Phishing Campaigns Targeting Think Tanks and NGOs. Retrieved January 11, 2017.", "url": "https://www.volexity.com/blog/2016/11/09/powerduke-post-election-spear-phishing-campaigns-targeting-think-tanks-and-ngos/"}, {"source_name": "GitHub Revoke-Obfuscation", "description": "Bohannon, D. (2017, July 27). Revoke-Obfuscation. Retrieved February 12, 2018.", "url": "https://github.com/danielbohannon/Revoke-Obfuscation"}, {"source_name": "FireEye Obfuscation June 2017", "description": "Bohannon, D. & Carr N. (2017, June 30). Obfuscation in the Wild: Targeted Attackers Lead the Way in Evasion Techniques. Retrieved February 12, 2018.", "url": "https://www.fireeye.com/blog/threat-research/2017/06/obfuscation-in-the-wild.html"}, {"source_name": "FireEye Revoke-Obfuscation July 2017", "description": "Bohannon, D. & Holmes, L. (2017, July 27). Revoke-Obfuscation: PowerShell Obfuscation Detection Using Science. Retrieved February 12, 2018.", "url": "https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/revoke-obfuscation-report.pdf"}, {"source_name": "GitHub Office-Crackros Aug 2016", "description": "Carr, N. (2016, August 14). OfficeCrackros. Retrieved February 12, 2018.", "url": "https://github.com/itsreallynick/office-crackros"}, {"source_name": "Linux/Cdorked.A We Live Security Analysis", "description": "Pierre-Marc Bureau. (2013, April 26). Linux/Cdorked.A: New Apache backdoor being used in the wild to serve Blackhole. Retrieved September 10, 2017.", "url": "https://www.welivesecurity.com/2013/04/26/linuxcdorked-new-apache-backdoor-in-the-wild-serves-blackhole/"}, {"source_name": "Carbon Black Obfuscation Sept 2016", "description": "Tedesco, B. (2016, September 23). Security Alert Summary. Retrieved February 12, 2018.", "url": "https://www.carbonblack.com/2016/09/23/security-advisory-variants-well-known-adware-families-discovered-include-sophisticated-obfuscation-techniques-previously-associated-nation-state-attacks/"}, {"source_name": "PaloAlto EncodedCommand March 2017", "description": "White, J. (2017, March 10). Pulling Back the Curtains on EncodedCommand PowerShell Attacks. Retrieved February 12, 2018.", "url": "https://researchcenter.paloaltonetworks.com/2017/03/unit42-pulling-back-the-curtains-on-encodedcommand-powershell-attacks/"}, {"source_name": "capec", "url": "https://capec.mitre.org/data/definitions/267.html", "external_id": "CAPEC-267"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_contributors": ["Red Canary", "Christiaan Beek, @ChristiaanBeek"], "x_mitre_data_sources": ["Process: OS API Execution", "Command: Command Execution", "File: File Creation", "Module: Module Load", "Process: Process Creation", "File: File Metadata"], "x_mitre_defense_bypassed": ["Host Forensic Analysis", "Signature-based Detection", "Host Intrusion Prevention Systems", "Application Control", "Log Analysis"], "x_mitre_deprecated": false, "x_mitre_detection": "Detection of file obfuscation is difficult unless artifacts are left behind by the obfuscation process that are uniquely detectable with a signature. If detection of the obfuscation itself is not possible, it may be possible to detect the malicious activity that caused the obfuscated file (for example, the method that was used to write, read, or modify the file on the file system). \n\nFlag and analyze commands containing indicators of obfuscation and known suspicious syntax such as uninterpreted escape characters like '''^''' and '''\"'''. Windows' Sysmon and Event ID 4688 displays command-line arguments for processes. Deobfuscation tools can be used to detect these indicators in files/payloads. (Citation: GitHub Revoke-Obfuscation) (Citation: FireEye Revoke-Obfuscation July 2017) (Citation: GitHub Office-Crackros Aug 2016) \n\nObfuscation used in payloads for Initial Access can be detected at the network. Use network intrusion detection systems and email gateway filtering to identify compressed and encrypted attachments and scripts. Some email attachment detonation systems can open compressed and encrypted attachments. Payloads delivered over an encrypted connection from a website require encrypted network traffic inspection. \n\nThe first detection of a malicious tool may trigger an anti-virus or other security tool alert. Similar events may also occur at the boundary through network IDS, email scanning appliance, etc. The initial detection should be treated as an indication of a potentially more invasive intrusion. The alerting system should be thoroughly investigated beyond that initial alert for activity that was not detected. Adversaries may continue with an operation, assuming that individual events like an anti-virus detect will not be investigated or that an analyst will not be able to conclusively link that event to other activity occurring on the network. ", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": false, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_platforms": ["Linux", "macOS", "Windows"], "x_mitre_version": "1.3"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--df8b2a25-8bdf-4856-953c-a04372b1c161", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2020-03-15T16:13:46.151Z", "modified": "2021-04-29T14:49:39.188Z", "name": "Web Protocols", "description": "Adversaries may communicate using application layer protocols associated with web traffic to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \n\nProtocols such as HTTP and HTTPS that carry web traffic may be very common in environments. HTTP/S packets have many fields and headers in which data can be concealed. An adversary may abuse these protocols to communicate with systems under their control within a victim network while also mimicking normal, expected traffic. ", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "command-and-control"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1071/001", "external_id": "T1071.001"}, {"source_name": "University of Birmingham C2", "description": "Gardiner, J.,  Cova, M., Nagaraja, S. (2014, February). Command & Control Understanding, Denying and Detecting. Retrieved April 20, 2016.", "url": "https://arxiv.org/ftp/arxiv/papers/1408/1408.1136.pdf"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_data_sources": ["Network Traffic: Network Traffic Flow", "Network Traffic: Network Traffic Content"], "x_mitre_detection": "Analyze network data for uncommon data flows (e.g., a client sending significantly more data than it receives from a server). Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious. Analyze packet contents to detect application layer protocols that do not follow the expected protocol standards regarding syntax, structure, or any other variable adversaries could leverage to conceal data.(Citation: University of Birmingham C2)\n\nMonitor for web traffic to/from known-bad or suspicious domains. ", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": true, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_platforms": ["Linux", "macOS", "Windows"], "x_mitre_version": "1.0"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--9efb1ea7-c37b-4595-9640-b7680cd84279", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2020-01-23T22:02:48.566Z", "modified": "2022-11-08T14:00:00.188Z", "name": "Registry Run Keys / Startup Folder", "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in.(Citation: Microsoft Run Key) These programs will be executed under the context of the user and will have the account's associated permissions level.\n\nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is <code>C:\\Users\\\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup</code>. The startup folder path for all users is <code>C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp</code>.\n\nThe following run keys are created by default on Windows systems:\n\n* <code>HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run</code>\n* <code>HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce</code>\n* <code>HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run</code>\n* <code>HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce</code>\n\nRun keys may exist under multiple hives.(Citation: Microsoft Wow6432Node 2018)(Citation: Malwarebytes Wow6432Node 2016) The <code>HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx</code> is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency.(Citation: Microsoft Run Key) For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: <code>reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\"</code> (Citation: Oddvar Moe RunOnceEx Mar 2018)\n\nThe following Registry keys can be used to set startup folder items for persistence:\n\n* <code>HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders</code>\n* <code>HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders</code>\n* <code>HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders</code>\n* <code>HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders</code>\n\nThe following Registry keys can control automatic startup of services during boot:\n\n* <code>HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce</code>\n* <code>HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce</code>\n* <code>HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices</code>\n* <code>HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices</code>\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\n* <code>HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run</code>\n* <code>HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run</code>\n\nThe Winlogon key controls actions that occur when a user logs on to a computer running Windows 7. Most of these actions are under the control of the operating system, but you can also add custom actions here. The <code>HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Userinit</code> and <code>HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Shell</code> subkeys can automatically launch programs.\n\nPrograms listed in the load value of the registry key <code>HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows</code> run when any user logs on.\n\nBy default, the multistring <code>BootExecute</code> value of the registry key <code>HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager</code> is set to <code>autocheck autochk *</code>. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\n\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use [Masquerading](https://attack.mitre.org/techniques/T1036) to make the Registry entries look as if they are associated with legitimate programs.", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "persistence"}, {"kill_chain_name": "mitre-attack", "phase_name": "privilege-escalation"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1547/001", "external_id": "T1547.001"}, {"source_name": "Malwarebytes Wow6432Node 2016", "description": "Arntz, P. (2016, March 30). Hiding in Plain Sight. Retrieved August 3, 2020.", "url": "https://blog.malwarebytes.com/cybercrime/2013/10/hiding-in-plain-sight/"}, {"source_name": "Microsoft Wow6432Node 2018", "description": "Microsoft. (2018, May 31). 32-bit and 64-bit Application Data in the Registry. Retrieved August 3, 2020.", "url": "https://docs.microsoft.com/en-us/windows/win32/sysinfo/32-bit-and-64-bit-application-data-in-the-registry"}, {"source_name": "Microsoft Run Key", "description": "Microsoft. (n.d.). Run and RunOnce Registry Keys. Retrieved November 12, 2014.", "url": "http://msdn.microsoft.com/en-us/library/aa376977"}, {"source_name": "Oddvar Moe RunOnceEx Mar 2018", "description": "Moe, O. (2018, March 21). Persistence using RunOnceEx - Hidden from Autoruns.exe. Retrieved June 29, 2018.", "url": "https://oddvar.moe/2018/03/21/persistence-using-runonceex-hidden-from-autoruns-exe/"}, {"source_name": "TechNet Autoruns", "description": "Russinovich, M. (2016, January 4). Autoruns for Windows v13.51. Retrieved June 6, 2016.", "url": "https://technet.microsoft.com/en-us/sysinternals/bb963902"}, {"source_name": "capec", "url": "https://capec.mitre.org/data/definitions/270.html", "external_id": "CAPEC-270"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_contributors": ["Oddvar Moe, @oddvarmoe", "Dray Agha, @Purp1eW0lf, Huntress Labs"], "x_mitre_data_sources": ["Windows Registry: Windows Registry Key Modification", "Command: Command Execution", "File: File Modification", "Process: Process Creation", "Windows Registry: Windows Registry Key Creation"], "x_mitre_deprecated": false, "x_mitre_detection": "Monitor Registry for changes to run keys that do not correlate with known software, patch cycles, etc. Monitor the start folder for additions or changes. Tools such as Sysinternals Autoruns may also be used to detect system changes that could be attempts at persistence, including listing the run keys' Registry locations and startup folders. (Citation: TechNet Autoruns) Suspicious program execution as startup programs may show up as outlier processes that have not been seen before when compared against historical data.\n\nChanges to these locations typically happen under normal conditions when legitimate software is installed. To increase confidence of malicious activity, data and events should not be viewed in isolation, but as part of a chain of behavior that could lead to other activities, such as network connections made for Command and Control, learning details about the environment through Discovery, and Lateral Movement.", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": true, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_permissions_required": ["Administrator", "User"], "x_mitre_platforms": ["Windows"], "x_mitre_version": "1.2"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--354a7f88-63fb-41b5-a801-ce3b377b36f1", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2017-05-31T21:31:04.307Z", "modified": "2022-11-08T14:00:00.188Z", "name": "System Information Discovery", "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use the information from [System Information Discovery](https://attack.mitre.org/techniques/T1082) during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\n\nTools such as [Systeminfo](https://attack.mitre.org/software/S0096) can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the <code>systemsetup</code> configuration tool on macOS. As an example, adversaries with user-level access can execute the <code>df -aH</code> command to obtain currently mounted disks and associated freely available space. Adversaries may also leverage a [Network Device CLI](https://attack.mitre.org/techniques/T1059/008) on network devices to gather detailed system information (e.g. <code>show version</code>).(Citation: US-CERT-TA18-106A) [System Information Discovery](https://attack.mitre.org/techniques/T1082) combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment.(Citation: OSX.FairyTale)(Citation: 20 macOS Common Tools and Techniques)\n\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.(Citation: Amazon Describe Instance)(Citation: Google Instances Resource)(Citation: Microsoft Virutal Machine API)", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1082", "external_id": "T1082"}, {"source_name": "Amazon Describe Instance", "description": "Amazon. (n.d.). describe-instance-information. Retrieved March 3, 2020.", "url": "https://docs.aws.amazon.com/cli/latest/reference/ssm/describe-instance-information.html"}, {"source_name": "Google Instances Resource", "description": "Google. (n.d.). Rest Resource: instance. Retrieved March 3, 2020.", "url": "https://cloud.google.com/compute/docs/reference/rest/v1/instances"}, {"source_name": "Microsoft Virutal Machine API", "description": "Microsoft. (2019, March 1). Virtual Machines - Get. Retrieved October 8, 2019.", "url": "https://docs.microsoft.com/en-us/rest/api/compute/virtualmachines/get"}, {"source_name": "20 macOS Common Tools and Techniques", "description": "Phil Stokes. (2021, February 16). 20 Common Tools & Techniques Used by macOS Threat Actors & Malware. Retrieved August 23, 2021.", "url": "https://labs.sentinelone.com/20-common-tools-techniques-used-by-macos-threat-actors-malware/"}, {"source_name": "OSX.FairyTale", "description": "Phile Stokes. (2018, September 20). On the Trail of OSX.FairyTale | Adware Playing at Malware. Retrieved August 24, 2021.", "url": "https://www.sentinelone.com/blog/trail-osx-fairytale-adware-playing-malware/"}, {"source_name": "US-CERT-TA18-106A", "description": "US-CERT. (2018, April 20). Alert (TA18-106A) Russian State-Sponsored Cyber Actors Targeting Network Infrastructure Devices. Retrieved October 19, 2020.", "url": "https://www.us-cert.gov/ncas/alerts/TA18-106A"}, {"source_name": "capec", "url": "https://capec.mitre.org/data/definitions/312.html", "external_id": "CAPEC-312"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_contributors": ["Maril Vernon @shewhohacks", "Praetorian", "Austin Clark, @c2defense"], "x_mitre_data_sources": ["Process: OS API Execution", "Process: Process Creation", "Command: Command Execution"], "x_mitre_deprecated": false, "x_mitre_detection": "System and network discovery techniques normally occur throughout an operation as an adversary learns the environment. Data and events should not be viewed in isolation, but as part of a chain of behavior that could lead to other activities based on the information obtained.\n\nMonitor processes and command-line arguments for actions that could be taken to gather system and network information. Remote access tools with built-in features may interact directly with the Windows API to gather information. Further, [Network Device CLI](https://attack.mitre.org/techniques/T1059/008) commands may also be used to gather  detailed system information with built-in features native to the network device platform.  Monitor CLI activity for unexpected or unauthorized use  commands being run by non-standard users from non-standard locations. Information may also be acquired through Windows system management tools such as [Windows Management Instrumentation](https://attack.mitre.org/techniques/T1047) and [PowerShell](https://attack.mitre.org/techniques/T1059/001).\n\nIn cloud-based systems, native logging can be used to identify access to certain APIs and dashboards that may contain system information. Depending on how the environment is used, that data alone may not be useful due to benign use during normal operations.", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": false, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_platforms": ["Windows", "IaaS", "Linux", "macOS", "Network"], "x_mitre_version": "2.5"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--3ccef7ae-cb5e-48f6-8302-897105fbf55c", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2017-12-14T16:46:06.044Z", "modified": "2022-05-24T14:00:00.188Z", "name": "Deobfuscate/Decode Files or Information", "description": "Adversaries may use [Obfuscated Files or Information](https://attack.mitre.org/techniques/T1027) to hide artifacts of an intrusion from analysis. They may require separate mechanisms to decode or deobfuscate that information depending on how they intend to use it. Methods for doing that include built-in functionality of malware or by using utilities present on the system.\n\nOne such example is use of [certutil](https://attack.mitre.org/software/S0160) to decode a remote access tool portable executable file that has been hidden inside a certificate file. (Citation: Malwarebytes Targeted Attack against Saudi Arabia) Another example is using the Windows <code>copy /b</code> command to reassemble binary fragments into a malicious payload. (Citation: Carbon Black Obfuscation Sept 2016)\n\nSometimes a user's action may be required to open it for deobfuscation or decryption as part of [User Execution](https://attack.mitre.org/techniques/T1204). The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary. (Citation: Volexity PowerDuke November 2016)", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "defense-evasion"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1140", "external_id": "T1140"}, {"source_name": "Volexity PowerDuke November 2016", "description": "Adair, S.. (2016, November 9). PowerDuke: Widespread Post-Election Spear Phishing Campaigns Targeting Think Tanks and NGOs. Retrieved January 11, 2017.", "url": "https://www.volexity.com/blog/2016/11/09/powerduke-post-election-spear-phishing-campaigns-targeting-think-tanks-and-ngos/"}, {"source_name": "Malwarebytes Targeted Attack against Saudi Arabia", "description": "Malwarebytes Labs. (2017, March 27). New targeted attack against Saudi Arabia Government. Retrieved July 3, 2017.", "url": "https://blog.malwarebytes.com/cybercrime/social-engineering-cybercrime/2017/03/new-targeted-attack-saudi-arabia-government/"}, {"source_name": "Carbon Black Obfuscation Sept 2016", "description": "Tedesco, B. (2016, September 23). Security Alert Summary. Retrieved February 12, 2018.", "url": "https://www.carbonblack.com/2016/09/23/security-advisory-variants-well-known-adware-families-discovered-include-sophisticated-obfuscation-techniques-previously-associated-nation-state-attacks/"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_contributors": ["Matthew Demaske, Adaptforward", "Red Canary"], "x_mitre_data_sources": ["Process: Process Creation", "File: File Modification", "Script: Script Execution"], "x_mitre_defense_bypassed": ["Anti-virus", "Host Intrusion Prevention Systems", "Signature-based Detection", "Network Intrusion Detection System"], "x_mitre_deprecated": false, "x_mitre_detection": "Detecting the action of deobfuscating or decoding files or information may be difficult depending on the implementation. If the functionality is contained within malware and uses the Windows API, then attempting to detect malicious behavior before or after the action may yield better results than attempting to perform analysis on loaded libraries or API calls. If scripts are used, then collecting the scripts for analysis may be necessary. Perform process and command-line monitoring to detect potentially malicious behavior related to scripts and system utilities such as [certutil](https://attack.mitre.org/software/S0160).\n\nMonitor the execution file paths and command-line arguments for common archive file applications and extensions, such as those for Zip and RAR archive tools, and correlate with other suspicious behavior to reduce false positives from normal user and administrator behavior.", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": false, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_platforms": ["Windows", "Linux", "macOS"], "x_mitre_version": "1.1"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--7bc57495-ea59-4380-be31-a64af124ef18", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2017-05-31T21:31:04.710Z", "modified": "2022-11-08T14:00:00.188Z", "name": "File and Directory Discovery", "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system. Adversaries may use the information from [File and Directory Discovery](https://attack.mitre.org/techniques/T1083) during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\n\nMany command shell utilities can be used to obtain this information. Examples include <code>dir</code>, <code>tree</code>, <code>ls</code>, <code>find</code>, and <code>locate</code>.(Citation: Windows Commands JPCERT) Custom tools may also be used to gather file and directory information and interact with the [Native API](https://attack.mitre.org/techniques/T1106). Adversaries may also leverage a [Network Device CLI](https://attack.mitre.org/techniques/T1059/008) on network devices to gather file and directory information (e.g. <code>dir</code>, <code>show flash</code>, and/or <code>nvram</code>).(Citation: US-CERT-TA18-106A)", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1083", "external_id": "T1083"}, {"source_name": "Windows Commands JPCERT", "description": "Tomonaga, S. (2016, January 26). Windows Commands Abused by Attackers. Retrieved February 2, 2016.", "url": "https://blogs.jpcert.or.jp/en/2016/01/windows-commands-abused-by-attackers.html"}, {"source_name": "US-CERT-TA18-106A", "description": "US-CERT. (2018, April 20). Alert (TA18-106A) Russian State-Sponsored Cyber Actors Targeting Network Infrastructure Devices. Retrieved October 19, 2020.", "url": "https://www.us-cert.gov/ncas/alerts/TA18-106A"}, {"source_name": "capec", "url": "https://capec.mitre.org/data/definitions/127.html", "external_id": "CAPEC-127"}, {"source_name": "capec", "url": "https://capec.mitre.org/data/definitions/497.html", "external_id": "CAPEC-497"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_contributors": ["Austin Clark, @c2defense"], "x_mitre_data_sources": ["Command: Command Execution", "Process: Process Creation", "Process: OS API Execution"], "x_mitre_deprecated": false, "x_mitre_detection": "System and network discovery techniques normally occur throughout an operation as an adversary learns the environment. Data and events should not be viewed in isolation, but as part of a chain of behavior that could lead to other activities, such as Collection and Exfiltration, based on the information obtained.\n\nMonitor processes and command-line arguments for actions that could be taken to gather system and network information. Remote access tools with built-in features may interact directly with the Windows API to gather information. Information may also be acquired through Windows system management tools such as [Windows Management Instrumentation](https://attack.mitre.org/techniques/T1047) and [PowerShell](https://attack.mitre.org/techniques/T1059/001). Further, [Network Device CLI](https://attack.mitre.org/techniques/T1059/008) commands may also be used to gather file and directory information with built-in features native to the network device platform.  Monitor CLI activity for unexpected or unauthorized use of commands being run by non-standard users from non-standard locations.  ", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": false, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_platforms": ["Linux", "macOS", "Windows", "Network"], "x_mitre_system_requirements": ["Some folders may require Administrator, SYSTEM or specific user depending on permission levels and access controls"], "x_mitre_version": "1.5"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--d63a3fb8-9452-4e9d-a60a-54be68d5998c", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2020-01-31T12:35:36.479Z", "modified": "2022-05-11T14:00:00.188Z", "name": "File Deletion", "description": "Adversaries may delete files left behind by the actions of their intrusion activity. Malware, tools, or other non-native files dropped or created on a system by an adversary (ex: [Ingress Tool Transfer](https://attack.mitre.org/techniques/T1105)) may leave traces to indicate to what was done within a network and how. Removal of these files can occur during an intrusion, or as part of a post-intrusion process to minimize the adversary's footprint.\n\nThere are tools available from the host operating system to perform cleanup, but adversaries may use other tools as well.(Citation: Microsoft SDelete July 2016) Examples of built-in [Command and Scripting Interpreter](https://attack.mitre.org/techniques/T1059) functions include <code>del</code> on Windows and <code>rm</code> or <code>unlink</code> on Linux and macOS.", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "defense-evasion"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1070/004", "external_id": "T1070.004"}, {"source_name": "Microsoft SDelete July 2016", "description": "Russinovich, M. (2016, July 4). SDelete v2.0. Retrieved February 8, 2018.", "url": "https://docs.microsoft.com/en-us/sysinternals/downloads/sdelete"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_contributors": ["Walker Johnson"], "x_mitre_data_sources": ["Command: Command Execution", "File: File Deletion"], "x_mitre_defense_bypassed": ["Host forensic analysis"], "x_mitre_deprecated": false, "x_mitre_detection": "It may be uncommon for events related to benign command-line functions such as DEL or third-party utilities or tools to be found in an environment, depending on the user base and how systems are typically used. Monitoring for command-line deletion functions to correlate with binaries or other files that an adversary may drop and remove may lead to detection of malicious activity. Another good practice is monitoring for known deletion and secure deletion tools that are not already on systems within an enterprise network that an adversary could introduce. Some monitoring tools may collect command-line arguments, but may not capture DEL commands since DEL is a native function within cmd.exe.", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": true, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_platforms": ["Linux", "macOS", "Windows"], "x_mitre_version": "1.1"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--8f4a33ec-8b1f-4b80-a2f6-642b2e479580", "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "created": "2017-05-31T21:30:48.728Z", "modified": "2021-04-29T14:49:39.188Z", "name": "Process Discovery", "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Adversaries may use the information from [Process Discovery](https://attack.mitre.org/techniques/T1057) during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\n\nIn Windows environments, adversaries could obtain details on running processes using the [Tasklist](https://attack.mitre.org/software/S0057) utility via [cmd](https://attack.mitre.org/software/S0106) or <code>Get-Process</code> via [PowerShell](https://attack.mitre.org/techniques/T1059/001). Information about processes can also be extracted from the output of [Native API](https://attack.mitre.org/techniques/T1106) calls such as <code>CreateToolhelp32Snapshot</code>. In Mac and Linux, this is accomplished with the <code>ps</code> command. Adversaries may also opt to enumerate processes via /proc.", "kill_chain_phases": [{"kill_chain_name": "mitre-attack", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-attack", "url": "https://attack.mitre.org/techniques/T1057", "external_id": "T1057"}, {"source_name": "capec", "url": "https://capec.mitre.org/data/definitions/573.html", "external_id": "CAPEC-573"}], "object_marking_refs": ["marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"], "x_mitre_attack_spec_version": "2.1.0", "x_mitre_data_sources": ["Process: OS API Execution", "Command: Command Execution", "Process: Process Creation"], "x_mitre_detection": "System and network discovery techniques normally occur throughout an operation as an adversary learns the environment. Data and events should not be viewed in isolation, but as part of a chain of behavior that could lead to other activities, such as Lateral Movement, based on the information obtained.\n\nNormal, benign system and network events that look like process discovery may be uncommon, depending on the environment and how they are used. Monitor processes and command-line arguments for actions that could be taken to gather system and network information. Remote access tools with built-in features may interact directly with the Windows API to gather information. Information may also be acquired through Windows system management tools such as [Windows Management Instrumentation](https://attack.mitre.org/techniques/T1047) and [PowerShell](https://attack.mitre.org/techniques/T1059/001).", "x_mitre_domains": ["enterprise-attack"], "x_mitre_is_subtechnique": false, "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5", "x_mitre_permissions_required": ["User", "Administrator", "SYSTEM"], "x_mitre_platforms": ["Linux", "macOS", "Windows"], "x_mitre_system_requirements": ["Administrator, SYSTEM may provide better process ownership details"], "x_mitre_version": "1.2"}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--e6dc4b5b-b4b9-485d-befa-43d6e30f4132", "created": "2023-01-13T02:30:41.380867Z", "modified": "2023-01-13T02:30:41.380867Z", "context": "Seed Event", "object_refs": ["attack-pattern--b77cf5f3-6060-475d-bd60-40ccbf28fdc2"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--d0a3b52e-43e3-48dd-86ca-fed9ce43221f", "created": "2023-01-13T02:30:41.579683Z", "modified": "2023-01-13T02:30:41.579683Z", "context": "Seed Event", "object_refs": ["attack-pattern--232b7f21-adf9-4b42-b936-b9d6f7df856e"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--8189d444-895f-4d06-b6e8-d5041ce70f1b", "created": "2023-01-13T02:30:41.775686Z", "modified": "2023-01-13T02:30:41.775686Z", "context": "Seed Event", "object_refs": ["attack-pattern--2e34237d-8574-43f6-aace-ae2915de8597"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--b7fe25f9-2b04-4f99-ad19-c4d348e2ceec", "created": "2023-01-13T02:30:41.970458Z", "modified": "2023-01-13T02:30:41.970458Z", "context": "Seed Event", "object_refs": ["attack-pattern--cbb66055-0325-4111-aca0-40547b6ad5b0"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--ac365eee-b953-4b2d-8eb1-8ae48901a266", "created": "2023-01-13T02:30:42.167715Z", "modified": "2023-01-13T02:30:42.167715Z", "context": "Seed Event", "object_refs": ["attack-pattern--dc31fe1e-d722-49da-8f5f-92c7b5aff534"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--28823b29-d6f3-4444-ab27-27df5ed8b3c8", "created": "2023-01-13T02:30:42.368218Z", "modified": "2023-01-13T02:30:42.368218Z", "context": "Seed Event", "object_refs": ["attack-pattern--970a3432-3237-47ad-bcca-7d8cbb217736"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--a3d48343-2cca-4314-81fb-b6a3a8fd4660", "created": "2023-01-13T02:30:42.564945Z", "modified": "2023-01-13T02:30:42.564945Z", "context": "Seed Event", "object_refs": ["attack-pattern--a2fdce72-04b2-409a-ac10-cc1695f4fce0"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--67fd76e6-66d3-4f32-9e57-23f06d787f36", "created": "2023-01-13T02:30:42.762082Z", "modified": "2023-01-13T02:30:42.762082Z", "context": "Hypothesized Event", "object_refs": ["attack-pattern--e6919abc-99f9-4c6c-95a5-14761e7b2add"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--b167d9de-c22b-4222-928e-969df262621e", "created": "2023-01-13T02:30:42.856201Z", "modified": "2023-01-13T02:30:42.856201Z", "context": "Hypothesized Event", "object_refs": ["attack-pattern--d1fcf083-a721-4223-aedf-bf8960798d62"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--fdb0b0d1-03ac-4d4a-9173-8be59a970ca8", "created": "2023-01-13T02:30:42.953655Z", "modified": "2023-01-13T02:30:42.953655Z", "context": "Hypothesized Event", "object_refs": ["attack-pattern--b3d682b6-98f2-4fb0-aa3b-b4df007ca70a"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--e762babc-a812-4c60-9419-0af2115aea06", "created": "2023-01-13T02:30:43.04966Z", "modified": "2023-01-13T02:30:43.04966Z", "context": "Hypothesized Event", "object_refs": ["attack-pattern--df8b2a25-8bdf-4856-953c-a04372b1c161"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--d772d1e3-fee2-4f3b-8d17-ef29e2f02d3a", "created": "2023-01-13T02:30:43.143794Z", "modified": "2023-01-13T02:30:43.143794Z", "context": "Hypothesized Event", "object_refs": ["attack-pattern--9efb1ea7-c37b-4595-9640-b7680cd84279"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--455ab03e-4c9d-48f3-8e76-2c431feb2488", "created": "2023-01-13T02:30:43.237926Z", "modified": "2023-01-13T02:30:43.237926Z", "context": "Hypothesized Event", "object_refs": ["attack-pattern--354a7f88-63fb-41b5-a801-ce3b377b36f1"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--c96b7144-407a-4187-98a0-b8a34b804f9f", "created": "2023-01-13T02:30:43.333336Z", "modified": "2023-01-13T02:30:43.333336Z", "context": "Hypothesized Event", "object_refs": ["attack-pattern--3ccef7ae-cb5e-48f6-8302-897105fbf55c"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--00d11066-757a-484c-8882-3c108b0f7ee1", "created": "2023-01-13T02:30:43.437901Z", "modified": "2023-01-13T02:30:43.437901Z", "context": "Hypothesized Event", "object_refs": ["attack-pattern--7bc57495-ea59-4380-be31-a64af124ef18"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--7d74ff09-9551-4036-8831-dae9508aa4bc", "created": "2023-01-13T02:30:43.535899Z", "modified": "2023-01-13T02:30:43.535899Z", "context": "Hypothesized Event", "object_refs": ["attack-pattern--d63a3fb8-9452-4e9d-a60a-54be68d5998c"]}, {"type": "grouping", "spec_version": "2.1", "id": "grouping--eda6dbf7-6739-4ced-afbb-4c144bf11a95", "created": "2023-01-13T02:30:43.634415Z", "modified": "2023-01-13T02:30:43.634415Z", "context": "Hypothesized Event", "object_refs": ["attack-pattern--8f4a33ec-8b1f-4b80-a2f6-642b2e479580"]}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--f2815559-f333-4f00-937f-2517fa72ac96", "created": "2023-01-13T02:30:42.763262Z", "modified": "2023-01-13T02:30:42.763262Z", "relationship_type": "0.724", "source_ref": "grouping--d0a3b52e-43e3-48dd-86ca-fed9ce43221f", "target_ref": "grouping--67fd76e6-66d3-4f32-9e57-23f06d787f36"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--221ae4c5-e7ad-476b-bde4-5d46ed1cafdd", "created": "2023-01-13T02:30:42.856201Z", "modified": "2023-01-13T02:30:42.856201Z", "relationship_type": "0.738", "source_ref": "grouping--d0a3b52e-43e3-48dd-86ca-fed9ce43221f", "target_ref": "grouping--b167d9de-c22b-4222-928e-969df262621e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--5989e3a8-da3d-416f-b65b-1e1e08ef5dd3", "created": "2023-01-13T02:30:43.04966Z", "modified": "2023-01-13T02:30:43.04966Z", "relationship_type": "0.7", "source_ref": "grouping--d0a3b52e-43e3-48dd-86ca-fed9ce43221f", "target_ref": "grouping--e762babc-a812-4c60-9419-0af2115aea06"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--b305d02d-09cf-4a72-8b86-57e69854c71e", "created": "2023-01-13T02:30:43.144795Z", "modified": "2023-01-13T02:30:43.144795Z", "relationship_type": "0.702", "source_ref": "grouping--d0a3b52e-43e3-48dd-86ca-fed9ce43221f", "target_ref": "grouping--d772d1e3-fee2-4f3b-8d17-ef29e2f02d3a"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--26ba66c5-79b0-42b8-9613-9dabcacfeea9", "created": "2023-01-13T02:30:43.237926Z", "modified": "2023-01-13T02:30:43.237926Z", "relationship_type": "0.702", "source_ref": "grouping--d0a3b52e-43e3-48dd-86ca-fed9ce43221f", "target_ref": "grouping--455ab03e-4c9d-48f3-8e76-2c431feb2488"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--ffc09ee4-5aad-466f-94e1-29161d4ece1f", "created": "2023-01-13T02:30:43.333336Z", "modified": "2023-01-13T02:30:43.333336Z", "relationship_type": "0.721", "source_ref": "grouping--d0a3b52e-43e3-48dd-86ca-fed9ce43221f", "target_ref": "grouping--c96b7144-407a-4187-98a0-b8a34b804f9f"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--1af3980a-560d-4998-bc39-9590749838f0", "created": "2023-01-13T02:30:43.334338Z", "modified": "2023-01-13T02:30:43.334338Z", "relationship_type": "0.729", "source_ref": "grouping--8189d444-895f-4d06-b6e8-d5041ce70f1b", "target_ref": "grouping--67fd76e6-66d3-4f32-9e57-23f06d787f36"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--baf132e2-0771-4e85-b711-6040dd168f5e", "created": "2023-01-13T02:30:43.334338Z", "modified": "2023-01-13T02:30:43.334338Z", "relationship_type": "0.72", "source_ref": "grouping--8189d444-895f-4d06-b6e8-d5041ce70f1b", "target_ref": "grouping--d0a3b52e-43e3-48dd-86ca-fed9ce43221f"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--ac4d94a3-8f77-48ed-bab0-6d30d447f543", "created": "2023-01-13T02:30:43.335337Z", "modified": "2023-01-13T02:30:43.335337Z", "relationship_type": "0.75", "source_ref": "grouping--8189d444-895f-4d06-b6e8-d5041ce70f1b", "target_ref": "grouping--e762babc-a812-4c60-9419-0af2115aea06"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--7fdc2f8d-210e-4507-83b4-26601df868b5", "created": "2023-01-13T02:30:43.335337Z", "modified": "2023-01-13T02:30:43.335337Z", "relationship_type": "0.704", "source_ref": "grouping--8189d444-895f-4d06-b6e8-d5041ce70f1b", "target_ref": "grouping--c96b7144-407a-4187-98a0-b8a34b804f9f"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--bc80b46d-dc9c-4408-9f33-0941d1537aba", "created": "2023-01-13T02:30:43.337336Z", "modified": "2023-01-13T02:30:43.337336Z", "relationship_type": "0.709", "source_ref": "grouping--28823b29-d6f3-4444-ab27-27df5ed8b3c8", "target_ref": "grouping--67fd76e6-66d3-4f32-9e57-23f06d787f36"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--d10b0177-9558-412a-a65a-1938a68ffe8c", "created": "2023-01-13T02:30:43.337336Z", "modified": "2023-01-13T02:30:43.337336Z", "relationship_type": "0.734", "source_ref": "grouping--28823b29-d6f3-4444-ab27-27df5ed8b3c8", "target_ref": "grouping--b167d9de-c22b-4222-928e-969df262621e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--1a2a330e-47a9-45cc-be37-72247392dc9b", "created": "2023-01-13T02:30:43.338336Z", "modified": "2023-01-13T02:30:43.338336Z", "relationship_type": "0.714", "source_ref": "grouping--28823b29-d6f3-4444-ab27-27df5ed8b3c8", "target_ref": "grouping--455ab03e-4c9d-48f3-8e76-2c431feb2488"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--4b16921b-1de6-4b83-b138-36d5cf801f72", "created": "2023-01-13T02:30:43.338336Z", "modified": "2023-01-13T02:30:43.338336Z", "relationship_type": "0.965", "source_ref": "grouping--28823b29-d6f3-4444-ab27-27df5ed8b3c8", "target_ref": "grouping--d0a3b52e-43e3-48dd-86ca-fed9ce43221f"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--99dc33ca-3b16-4e06-94c6-7f0b74816ffa", "created": "2023-01-13T02:30:43.338336Z", "modified": "2023-01-13T02:30:43.338336Z", "relationship_type": "0.902", "source_ref": "grouping--28823b29-d6f3-4444-ab27-27df5ed8b3c8", "target_ref": "grouping--8189d444-895f-4d06-b6e8-d5041ce70f1b"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--7c5b9eac-1478-4414-a48c-456c751443f5", "created": "2023-01-13T02:30:43.338336Z", "modified": "2023-01-13T02:30:43.338336Z", "relationship_type": "0.817", "source_ref": "grouping--28823b29-d6f3-4444-ab27-27df5ed8b3c8", "target_ref": "grouping--fdb0b0d1-03ac-4d4a-9173-8be59a970ca8"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--95ac0f98-2846-48f1-8d40-888d766a4cd4", "created": "2023-01-13T02:30:43.339338Z", "modified": "2023-01-13T02:30:43.339338Z", "relationship_type": "0.769", "source_ref": "grouping--28823b29-d6f3-4444-ab27-27df5ed8b3c8", "target_ref": "grouping--e762babc-a812-4c60-9419-0af2115aea06"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--04514e9d-309d-4028-85d7-2d2dde3ae685", "created": "2023-01-13T02:30:43.340337Z", "modified": "2023-01-13T02:30:43.340337Z", "relationship_type": "0.704", "source_ref": "grouping--67fd76e6-66d3-4f32-9e57-23f06d787f36", "target_ref": "grouping--455ab03e-4c9d-48f3-8e76-2c431feb2488"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--0deba889-f35b-4923-b6c9-b91bb9919448", "created": "2023-01-13T02:30:43.341338Z", "modified": "2023-01-13T02:30:43.341338Z", "relationship_type": "0.716", "source_ref": "grouping--b167d9de-c22b-4222-928e-969df262621e", "target_ref": "grouping--67fd76e6-66d3-4f32-9e57-23f06d787f36"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--02136db4-021b-4e77-b31a-1be373860946", "created": "2023-01-13T02:30:43.342427Z", "modified": "2023-01-13T02:30:43.342427Z", "relationship_type": "0.703", "source_ref": "grouping--b167d9de-c22b-4222-928e-969df262621e", "target_ref": "grouping--8189d444-895f-4d06-b6e8-d5041ce70f1b"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--d39b573e-2177-4bf7-9e24-2e502679b4d8", "created": "2023-01-13T02:30:43.438897Z", "modified": "2023-01-13T02:30:43.438897Z", "relationship_type": "0.7", "source_ref": "grouping--b167d9de-c22b-4222-928e-969df262621e", "target_ref": "grouping--e762babc-a812-4c60-9419-0af2115aea06"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--e887237d-5a33-4db1-bd63-84b54e1f2666", "created": "2023-01-13T02:30:43.537902Z", "modified": "2023-01-13T02:30:43.537902Z", "relationship_type": "0.8", "source_ref": "grouping--fdb0b0d1-03ac-4d4a-9173-8be59a970ca8", "target_ref": "grouping--8189d444-895f-4d06-b6e8-d5041ce70f1b"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--7a148a63-77b5-4619-b79c-e9fafb7fd183", "created": "2023-01-13T02:30:43.537902Z", "modified": "2023-01-13T02:30:43.537902Z", "relationship_type": "0.731", "source_ref": "grouping--fdb0b0d1-03ac-4d4a-9173-8be59a970ca8", "target_ref": "grouping--67fd76e6-66d3-4f32-9e57-23f06d787f36"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--4df0a061-db93-4fbf-bef5-8ada353f8f80", "created": "2023-01-13T02:30:43.538899Z", "modified": "2023-01-13T02:30:43.538899Z", "relationship_type": "0.784", "source_ref": "grouping--fdb0b0d1-03ac-4d4a-9173-8be59a970ca8", "target_ref": "grouping--d0a3b52e-43e3-48dd-86ca-fed9ce43221f"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--3b4095e1-89f6-47df-b073-c6fb31df9f35", "created": "2023-01-13T02:30:43.538899Z", "modified": "2023-01-13T02:30:43.538899Z", "relationship_type": "0.705", "source_ref": "grouping--fdb0b0d1-03ac-4d4a-9173-8be59a970ca8", "target_ref": "grouping--b167d9de-c22b-4222-928e-969df262621e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--80045907-6857-43cb-8838-54a077d1daf9", "created": "2023-01-13T02:30:43.634415Z", "modified": "2023-01-13T02:30:43.634415Z", "relationship_type": "0.701", "source_ref": "grouping--fdb0b0d1-03ac-4d4a-9173-8be59a970ca8", "target_ref": "grouping--eda6dbf7-6739-4ced-afbb-4c144bf11a95"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--f4d61bbb-5185-442f-b6d7-edb80f55ecf9", "created": "2023-01-13T02:30:43.635416Z", "modified": "2023-01-13T02:30:43.635416Z", "relationship_type": "0.718", "source_ref": "grouping--e762babc-a812-4c60-9419-0af2115aea06", "target_ref": "grouping--67fd76e6-66d3-4f32-9e57-23f06d787f36"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--b227f402-b836-43df-aec1-e3f72e8da8e8", "created": "2023-01-13T02:30:43.637416Z", "modified": "2023-01-13T02:30:43.637416Z", "relationship_type": "0.701", "source_ref": "grouping--e762babc-a812-4c60-9419-0af2115aea06", "target_ref": "grouping--fdb0b0d1-03ac-4d4a-9173-8be59a970ca8"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--bc32ac02-7b83-4683-afcd-1aa0996b66fb", "created": "2023-01-13T02:30:43.637416Z", "modified": "2023-01-13T02:30:43.637416Z", "relationship_type": "0.708", "source_ref": "grouping--d772d1e3-fee2-4f3b-8d17-ef29e2f02d3a", "target_ref": "grouping--00d11066-757a-484c-8882-3c108b0f7ee1"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--429f0d6b-bf0c-4718-819d-d77677314196", "created": "2023-01-13T02:30:43.637416Z", "modified": "2023-01-13T02:30:43.637416Z", "relationship_type": "0.745", "source_ref": "grouping--d772d1e3-fee2-4f3b-8d17-ef29e2f02d3a", "target_ref": "grouping--67fd76e6-66d3-4f32-9e57-23f06d787f36"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--5beb4d73-01c3-477e-a55b-6ba48a83c500", "created": "2023-01-13T02:30:43.637416Z", "modified": "2023-01-13T02:30:43.637416Z", "relationship_type": "0.792", "source_ref": "grouping--d772d1e3-fee2-4f3b-8d17-ef29e2f02d3a", "target_ref": "grouping--8189d444-895f-4d06-b6e8-d5041ce70f1b"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--335a59eb-1d5f-4f25-8ba7-c71811efba9d", "created": "2023-01-13T02:30:43.638469Z", "modified": "2023-01-13T02:30:43.638469Z", "relationship_type": "0.709", "source_ref": "grouping--d772d1e3-fee2-4f3b-8d17-ef29e2f02d3a", "target_ref": "grouping--e762babc-a812-4c60-9419-0af2115aea06"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--abbcfe6c-8dc6-4919-b3b8-9a8f74dafe85", "created": "2023-01-13T02:30:43.638469Z", "modified": "2023-01-13T02:30:43.638469Z", "relationship_type": "0.7", "source_ref": "grouping--d772d1e3-fee2-4f3b-8d17-ef29e2f02d3a", "target_ref": "grouping--fdb0b0d1-03ac-4d4a-9173-8be59a970ca8"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--646e4eb5-d79e-483a-861e-f88c543623d2", "created": "2023-01-13T02:30:43.638469Z", "modified": "2023-01-13T02:30:43.638469Z", "relationship_type": "0.701", "source_ref": "grouping--d772d1e3-fee2-4f3b-8d17-ef29e2f02d3a", "target_ref": "grouping--b167d9de-c22b-4222-928e-969df262621e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--f312865f-5511-40e2-9bb3-f33dab159a9a", "created": "2023-01-13T02:30:43.640414Z", "modified": "2023-01-13T02:30:43.640414Z", "relationship_type": "0.761", "source_ref": "grouping--455ab03e-4c9d-48f3-8e76-2c431feb2488", "target_ref": "grouping--8189d444-895f-4d06-b6e8-d5041ce70f1b"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--1ad4d189-1d14-4065-a6ea-8b9f942af66a", "created": "2023-01-13T02:30:43.640414Z", "modified": "2023-01-13T02:30:43.640414Z", "relationship_type": "0.75", "source_ref": "grouping--455ab03e-4c9d-48f3-8e76-2c431feb2488", "target_ref": "grouping--e762babc-a812-4c60-9419-0af2115aea06"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--90517350-ea86-43c8-8422-efda43f2cf25", "created": "2023-01-13T02:30:43.641413Z", "modified": "2023-01-13T02:30:43.641413Z", "relationship_type": "0.736", "source_ref": "grouping--455ab03e-4c9d-48f3-8e76-2c431feb2488", "target_ref": "grouping--d772d1e3-fee2-4f3b-8d17-ef29e2f02d3a"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--146bf3fb-7dd8-430a-a6da-8352bf4e2c5e", "created": "2023-01-13T02:30:43.641413Z", "modified": "2023-01-13T02:30:43.641413Z", "relationship_type": "0.701", "source_ref": "grouping--455ab03e-4c9d-48f3-8e76-2c431feb2488", "target_ref": "grouping--b167d9de-c22b-4222-928e-969df262621e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--8e2631ac-4beb-4606-9dab-41c428fdd83f", "created": "2023-01-13T02:30:43.642415Z", "modified": "2023-01-13T02:30:43.642415Z", "relationship_type": "0.711", "source_ref": "grouping--455ab03e-4c9d-48f3-8e76-2c431feb2488", "target_ref": "grouping--fdb0b0d1-03ac-4d4a-9173-8be59a970ca8"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--9a37e9f4-6fe9-4556-a357-2f9d037b670d", "created": "2023-01-13T02:30:43.642415Z", "modified": "2023-01-13T02:30:43.642415Z", "relationship_type": "0.727", "source_ref": "grouping--c96b7144-407a-4187-98a0-b8a34b804f9f", "target_ref": "grouping--67fd76e6-66d3-4f32-9e57-23f06d787f36"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--7570f1cb-3b6c-4f11-806c-2db92047a7a9", "created": "2023-01-13T02:30:43.642415Z", "modified": "2023-01-13T02:30:43.642415Z", "relationship_type": "0.71", "source_ref": "grouping--c96b7144-407a-4187-98a0-b8a34b804f9f", "target_ref": "grouping--00d11066-757a-484c-8882-3c108b0f7ee1"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--bc6cda26-5903-479f-8bc0-7aa2b80d4199", "created": "2023-01-13T02:30:43.642415Z", "modified": "2023-01-13T02:30:43.642415Z", "relationship_type": "0.733", "source_ref": "grouping--c96b7144-407a-4187-98a0-b8a34b804f9f", "target_ref": "grouping--b167d9de-c22b-4222-928e-969df262621e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--e0b1de7f-9a89-408e-a1eb-a69646d59c7b", "created": "2023-01-13T02:30:43.643414Z", "modified": "2023-01-13T02:30:43.643414Z", "relationship_type": "0.706", "source_ref": "grouping--c96b7144-407a-4187-98a0-b8a34b804f9f", "target_ref": "grouping--e762babc-a812-4c60-9419-0af2115aea06"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--aa36bc53-c6de-4a28-b83c-d8c699524200", "created": "2023-01-13T02:30:43.643414Z", "modified": "2023-01-13T02:30:43.643414Z", "relationship_type": "0.764", "source_ref": "grouping--c96b7144-407a-4187-98a0-b8a34b804f9f", "target_ref": "grouping--eda6dbf7-6739-4ced-afbb-4c144bf11a95"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--ff9a6bae-0309-4c25-94b8-625fc9ba10ce", "created": "2023-01-13T02:30:43.644412Z", "modified": "2023-01-13T02:30:43.644412Z", "relationship_type": "0.701", "source_ref": "grouping--c96b7144-407a-4187-98a0-b8a34b804f9f", "target_ref": "grouping--455ab03e-4c9d-48f3-8e76-2c431feb2488"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--2b29e723-6cc3-4503-bce2-274ef7b25fd7", "created": "2023-01-13T02:30:43.644412Z", "modified": "2023-01-13T02:30:43.644412Z", "relationship_type": "0.711", "source_ref": "grouping--c96b7144-407a-4187-98a0-b8a34b804f9f", "target_ref": "grouping--fdb0b0d1-03ac-4d4a-9173-8be59a970ca8"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--1cdee3e4-c7e5-4307-bd5e-7df1821e9d2a", "created": "2023-01-13T02:30:43.644412Z", "modified": "2023-01-13T02:30:43.644412Z", "relationship_type": "0.785", "source_ref": "grouping--00d11066-757a-484c-8882-3c108b0f7ee1", "target_ref": "grouping--67fd76e6-66d3-4f32-9e57-23f06d787f36"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--1e562a15-7da9-409b-9942-3fbdce9c5116", "created": "2023-01-13T02:30:43.645413Z", "modified": "2023-01-13T02:30:43.645413Z", "relationship_type": "0.745", "source_ref": "grouping--00d11066-757a-484c-8882-3c108b0f7ee1", "target_ref": "grouping--b167d9de-c22b-4222-928e-969df262621e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--a2c17f83-02e2-4cfb-98a5-ae622076b796", "created": "2023-01-13T02:30:43.645413Z", "modified": "2023-01-13T02:30:43.645413Z", "relationship_type": "0.935", "source_ref": "grouping--00d11066-757a-484c-8882-3c108b0f7ee1", "target_ref": "grouping--d0a3b52e-43e3-48dd-86ca-fed9ce43221f"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--49ba264a-07c3-4cc1-8eac-1969a95099c8", "created": "2023-01-13T02:30:43.645413Z", "modified": "2023-01-13T02:30:43.645413Z", "relationship_type": "0.782", "source_ref": "grouping--00d11066-757a-484c-8882-3c108b0f7ee1", "target_ref": "grouping--8189d444-895f-4d06-b6e8-d5041ce70f1b"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--4d0e678f-77a2-4d3d-898b-432f0795b8e8", "created": "2023-01-13T02:30:43.645413Z", "modified": "2023-01-13T02:30:43.645413Z", "relationship_type": "0.708", "source_ref": "grouping--00d11066-757a-484c-8882-3c108b0f7ee1", "target_ref": "grouping--455ab03e-4c9d-48f3-8e76-2c431feb2488"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--45deeaeb-74e6-4428-8611-2ad3d9dc5aa6", "created": "2023-01-13T02:30:43.646415Z", "modified": "2023-01-13T02:30:43.646415Z", "relationship_type": "0.7", "source_ref": "grouping--00d11066-757a-484c-8882-3c108b0f7ee1", "target_ref": "grouping--fdb0b0d1-03ac-4d4a-9173-8be59a970ca8"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--9c243067-8586-4b34-9140-38d3c8c4ab65", "created": "2023-01-13T02:30:43.646415Z", "modified": "2023-01-13T02:30:43.646415Z", "relationship_type": "0.7", "source_ref": "grouping--00d11066-757a-484c-8882-3c108b0f7ee1", "target_ref": "grouping--7d74ff09-9551-4036-8831-dae9508aa4bc"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--57a25b34-e4e8-4729-9c7d-1a45c951cbf2", "created": "2023-01-13T02:30:43.646415Z", "modified": "2023-01-13T02:30:43.646415Z", "relationship_type": "0.7", "source_ref": "grouping--00d11066-757a-484c-8882-3c108b0f7ee1", "target_ref": "grouping--e762babc-a812-4c60-9419-0af2115aea06"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--1568c392-b1f9-499f-b316-e92d8cf209a8", "created": "2023-01-13T02:30:43.647412Z", "modified": "2023-01-13T02:30:43.647412Z", "relationship_type": "0.839", "source_ref": "grouping--7d74ff09-9551-4036-8831-dae9508aa4bc", "target_ref": "grouping--455ab03e-4c9d-48f3-8e76-2c431feb2488"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--29a1101c-2ca5-4cf0-ba29-46461d59a6bb", "created": "2023-01-13T02:30:43.647412Z", "modified": "2023-01-13T02:30:43.647412Z", "relationship_type": "0.759", "source_ref": "grouping--7d74ff09-9551-4036-8831-dae9508aa4bc", "target_ref": "grouping--67fd76e6-66d3-4f32-9e57-23f06d787f36"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--51912ed4-c8ef-4c29-9d91-7eb081ab8b89", "created": "2023-01-13T02:30:43.647412Z", "modified": "2023-01-13T02:30:43.647412Z", "relationship_type": "0.706", "source_ref": "grouping--7d74ff09-9551-4036-8831-dae9508aa4bc", "target_ref": "grouping--e762babc-a812-4c60-9419-0af2115aea06"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--36b1399f-c1be-4746-bcb9-45c44e17ab67", "created": "2023-01-13T02:30:43.648415Z", "modified": "2023-01-13T02:30:43.648415Z", "relationship_type": "0.933", "source_ref": "grouping--7d74ff09-9551-4036-8831-dae9508aa4bc", "target_ref": "grouping--d0a3b52e-43e3-48dd-86ca-fed9ce43221f"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--2e70d02e-fc93-4e42-8adc-ca8e530921f6", "created": "2023-01-13T02:30:43.648415Z", "modified": "2023-01-13T02:30:43.648415Z", "relationship_type": "0.778", "source_ref": "grouping--7d74ff09-9551-4036-8831-dae9508aa4bc", "target_ref": "grouping--8189d444-895f-4d06-b6e8-d5041ce70f1b"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--5b8250f4-397e-483a-a466-df6faf921e77", "created": "2023-01-13T02:30:43.648415Z", "modified": "2023-01-13T02:30:43.648415Z", "relationship_type": "0.759", "source_ref": "grouping--7d74ff09-9551-4036-8831-dae9508aa4bc", "target_ref": "grouping--fdb0b0d1-03ac-4d4a-9173-8be59a970ca8"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--b69b0d5e-1dab-45da-bff0-e2589c3a989c", "created": "2023-01-13T02:30:43.648415Z", "modified": "2023-01-13T02:30:43.648415Z", "relationship_type": "0.7", "source_ref": "grouping--7d74ff09-9551-4036-8831-dae9508aa4bc", "target_ref": "grouping--d772d1e3-fee2-4f3b-8d17-ef29e2f02d3a"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--a0c3e8b1-cda6-4267-871f-b8d59937e1fd", "created": "2023-01-13T02:30:43.649415Z", "modified": "2023-01-13T02:30:43.649415Z", "relationship_type": "0.707", "source_ref": "grouping--7d74ff09-9551-4036-8831-dae9508aa4bc", "target_ref": "grouping--b167d9de-c22b-4222-928e-969df262621e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--5707d2c4-5dee-4bd3-b767-43d650866d71", "created": "2023-01-13T02:30:43.650414Z", "modified": "2023-01-13T02:30:43.650414Z", "relationship_type": "0.73", "source_ref": "grouping--eda6dbf7-6739-4ced-afbb-4c144bf11a95", "target_ref": "grouping--455ab03e-4c9d-48f3-8e76-2c431feb2488"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--c3633bcd-abf8-4eda-a14f-04bfd4e772ed", "created": "2023-01-13T02:30:43.650414Z", "modified": "2023-01-13T02:30:43.650414Z", "relationship_type": "0.708", "source_ref": "grouping--eda6dbf7-6739-4ced-afbb-4c144bf11a95", "target_ref": "grouping--00d11066-757a-484c-8882-3c108b0f7ee1"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--1eb18505-b44a-4dca-9219-df5d05734d33", "created": "2023-01-13T02:30:43.650414Z", "modified": "2023-01-13T02:30:43.650414Z", "relationship_type": "0.745", "source_ref": "grouping--eda6dbf7-6739-4ced-afbb-4c144bf11a95", "target_ref": "grouping--67fd76e6-66d3-4f32-9e57-23f06d787f36"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--8eb6b433-9e97-48b8-8624-8c48cb8be8bc", "created": "2023-01-13T02:30:43.650414Z", "modified": "2023-01-13T02:30:43.650414Z", "relationship_type": "0.75", "source_ref": "grouping--eda6dbf7-6739-4ced-afbb-4c144bf11a95", "target_ref": "grouping--d772d1e3-fee2-4f3b-8d17-ef29e2f02d3a"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--73d2f07a-7f89-4371-af2f-d240985c1325", "created": "2023-01-13T02:30:43.650414Z", "modified": "2023-01-13T02:30:43.650414Z", "relationship_type": "0.953", "source_ref": "grouping--eda6dbf7-6739-4ced-afbb-4c144bf11a95", "target_ref": "grouping--d0a3b52e-43e3-48dd-86ca-fed9ce43221f"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--c3d31ea7-3b7f-4ea1-8460-6229c077d393", "created": "2023-01-13T02:30:43.650414Z", "modified": "2023-01-13T02:30:43.650414Z", "relationship_type": "0.788", "source_ref": "grouping--eda6dbf7-6739-4ced-afbb-4c144bf11a95", "target_ref": "grouping--8189d444-895f-4d06-b6e8-d5041ce70f1b"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--0db5e670-e5b3-45af-bdc5-7ff51a9a6f88", "created": "2023-01-13T02:30:43.651414Z", "modified": "2023-01-13T02:30:43.651414Z", "relationship_type": "0.785", "source_ref": "grouping--eda6dbf7-6739-4ced-afbb-4c144bf11a95", "target_ref": "grouping--b167d9de-c22b-4222-928e-969df262621e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--3ddffb7f-c8e8-44cd-801d-d2fb2b442c32", "created": "2023-01-13T02:30:43.651414Z", "modified": "2023-01-13T02:30:43.651414Z", "relationship_type": "0.7", "source_ref": "grouping--eda6dbf7-6739-4ced-afbb-4c144bf11a95", "target_ref": "grouping--7d74ff09-9551-4036-8831-dae9508aa4bc"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--b153f51c-5f73-42fd-9c9b-055039e804a1", "created": "2023-01-13T02:30:43.652414Z", "modified": "2023-01-13T02:30:43.652414Z", "relationship_type": "0.707", "source_ref": "grouping--eda6dbf7-6739-4ced-afbb-4c144bf11a95", "target_ref": "grouping--e762babc-a812-4c60-9419-0af2115aea06"}]}